Spliting of Data

In [39]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from sklearn.preprocessing import *
from sklearn.impute import SimpleImputer
from sklearn.model_selection import train_test_split

Read the data and display its size

In [40]:
data = pd.read_csv('Data.csv', delimiter=',')
data.shape

(10, 4)

display the first 5 elements

In [41]:
data.head(5)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

display the last 5 elements

In [42]:
data.tail(5)

   Country   Age   Salary Purchased
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

Spliting the variables

independent variables

In [48]:
x = data.iloc[:,0:3].values #the first value is the row, the second one is the columns
x

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [49]:
dfIndependant = pd.DataFrame(x, columns=['Country','age','Salary']) # represent is as a dataframe to make is clear
df

   Country   age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN

now the Dependant variable

In [45]:
y = data.iloc[:,3:4].values
dependant

array([['No'],
       ['Yes'],
       ['No'],
       ['No'],
       ['Yes'],
       ['Yes'],
       ['No'],
       ['Yes'],
       ['No'],
       ['Yes']], dtype=object)

In [50]:
dfDependant = pd.DataFrame(y, columns=['Purchased'])
dfDependant

  Purchased
0        No
1       Yes
2        No
3        No
4       Yes
5       Yes
6        No
7       Yes
8        No
9       Yes

dividing the training and test set

In [51]:
 X_train, X_test, y_train, y_test = train_test_split( x, y, test_size=0.2, random_state=0)

displaye the x

In [54]:
X_train
df = pd.DataFrame(X_train)
df

         0     1        2
0  Germany  40.0      NaN
1   France  37.0  67000.0
2    Spain  27.0  48000.0
3    Spain   NaN  52000.0
4   France  48.0  79000.0
5    Spain  38.0  61000.0
6   France  44.0  72000.0
7   France  35.0  58000.0

In [55]:
X_test
df = pd.DataFrame(X_test)
df

         0     1        2
0  Germany  30.0  54000.0
1  Germany  50.0  83000.0

display the y set

In [56]:
y_train
df = pd.DataFrame(y_train)
df

     0
0  Yes
1  Yes
2  Yes
3   No
4  Yes
5   No
6   No
7  Yes

In [57]:
y_test
df = pd.DataFrame(y_test)
df

    0
0  No
1  No

PreProcesing

In [ ]:
data.isbull().val